Src/OpenFOAM/OpenFOAM-5.x-master/tutorials/lagrangian/simpleReactingParcelFoam/verticalChannel/constant/reactions
species
(
    air
    H2O
);

reactions
{}
